digiexchris/PIDKiln/firmware/test-app/sdkconfig.defaults
# Linux host target configuration
CONFIG_IDF_TARGET="linux"

# Disable watchdogs for testing
CONFIG_ESP_INT_WDT=n
CONFIG_ESP_TASK_WDT=n

# Run-time checks of Heap and Stack
CONFIG_HEAP_POISONING_COMPREHENSIVE=y
CONFIG_COMPILER_STACK_CHECK_MODE_STRONG=y
CONFIG_COMPILER_STACK_CHECK=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16000
